[FunctionHelp]
$casenum9=9@$Casenum@$CASENUM@Número de secuencia de caso actual. En cada caso, $CASENUM es el número de casos leídos, incluyendo ese caso. El formato es F8.0. El valor de $CASENUM no es necesariamente el número de fila en una ventana del Editor de datos (disponible en entornos de Windows), y el valor cambia se la fila está ordenada o si se insertan nuevos casos antes del final de la fila.
$sysmis10=10@$Sysmis@$SYSMIS@Valor perdido del sistema. El valor perdido del sistema se muestra como un punto (.) o cualquier otro símbolo que se utilice como indicador decimal.
$date4=4@$Date@$DATE@Fecha actual en formato de fecha internacional con año de dos dígitos. El formato es A9 con la forma de dd-mmm-aa.
$jdate4=4@$JDate@$JDATE@Fecha actual en número de días desde el 14 de octubre de 1582 (día 1 del calendario gregoriano). El formato es F6.0.
$date114=4@$Date11@$DATE11@Fecha actual en formato de fecha internacional con año de cuatro dígitos. El formato es A11 con la forma de dd-mmm-aaaa.
$time4=4@$Time@$TIME@Fecha y hora actuales. $TIME representa el número de segundos transcurridos desde la medianoche del 14 de octubre de 1582 hasta la fecha y la hora en que se ejecuta el comando de transformación. El formato es F20. Puede mostrar la fecha con diferentes formatos. También puede utilizarla en funciones de fecha y hora.
abs1=1@Abs@ABS(?)@ABS(expr_num). Numérico. Devuelve el valor absoluto de expr_num, que debe ser un valor numérico.
any13=13@Any@ANY(?,?)@ANY(prueba, valor[,valor,...]). Lógico. Devuelve 1 o verdadero si el valor de prueba coincide con cualquiera de los valores subsiguientes; si no devuelve 0 o falso. Esta función requiere dos o más argumentos. Por ejemplo, ANY(var1, 1, 3, 5) devuelve 1 si el valor de var1 es 1, 3, ó 5 y 0 para el resto de valores. ANY también se puede utilizar para explorar una lista de variables o expresiones de un valor. Por ejemplo, ANY(1, var1, var2, var3) devuelve 1 si cualquiera de las tres variables especificadas tiene un valor de 1; y 0 si las otras tres variables tienen valores diferentes a 1.
applymodel19=19@Applymodel@ApplyModel(?,?,?)@ApplyModel(asa,"función",valor). Numérico. Aplica una función de puntuación particular a los datos por casos de entrada, utilizando el modelo especificado en el asa y donde "función" es uno de los siguientes valores literales entrecomillado: predict, stddev, probability, confidence, nodeid, cumhazard, neighbor, distance. El asa del modelo es el nombre asociado al archivo XML externo, tal como se haya definido en el comando MODEL HANDLE. El tercer argumento opcional se aplica cuando la función es "probability", "neighbor" o "distance". En "probability", especifica una categoría para la que se calcula la probabilidad. En "neighbor" y "distance", especifica un vecino concreto (como un entero) para los modelos de vecinos más cercanos. ApplyModel devuelve el valor perdido del sistema si un valor no puede ser calculado.
arsin1=1@Arsin@ARSIN(?)@ARSIN(expr_num). Numérico. Devuelve el seno inverso (el arcoseno), en radianes, de expr_num, que debe ser evaluable a un valor numérico entre -1 y +1.
artan1=1@Artan@ARTAN(?)@ARTAN(expr_num). Numérico. Devuelve la tangente inversa (arcotangente), en radianes, de la expresión numérica. expr_num debe ser un valor numérico.
cdf.bernoulli2=2@Cdf.Bernoulli@CDF.BERNOULLI(?,?)@CDF.BERNOULLI(c, p). Numérico. Devuelve la probabilidad acumulada de que un valor de la distribución de Bernoulli, con el parámetro de probabilidad dado, sea menor o igual a c.
cdf.beta2=2@Cdf.Beta@CDF.BETA(?,?,?)@CDF.BETA(c, forma1, forma2). Numérico. Devuelve la probabilidad acumulada de que un valor de la distribución de Beta, con el parámetro de forma dado, sea menor que c.
cdf.binom2=2@Cdf.Binom@CDF.BINOM(?,?,?)@CDF.BINOM(c, n, p). Numérico. Devuelve la probabilidad acumulada de que el número de éxitos en n ensayos, con probabilidad de éxito p en cada uno de ellos, sea menor o igual que c. Cuando n es 1, el valor es el mismo que el de CDF.BERNOULLI.
cdf.bvnor2=2@Cdf.Bvnor@CDF.BVNOR(?)@CDF.BVNOR(c1, c2, r). Numérico. Devuelve la probabilidad acumulada de que un valor de la distribución normal bivariante, con el parámetro de correlación dado, se menor que c1 y c2.
cdf.cauchy2=2@Cdf.Cauchy@CDF.CAUCHY(?,?,?)@CDF.CAUCHY(c, loc, escala). Numérico. Devuelve la probabilidad acumulada de que un valor de la distribución de Cauchy, con los parámetros de ubicación y escala dados, sea menor que c.
cdf.chisq2=2@Cdf.Chisq@CDF.CHISQ(?,?)@CDF.CHISQ(c, gl). Numérico. Devuelve la probabilidad acumulada de que un valor de la distribución de chi-cuadrado, con los grados de libertad dados, sea menor que c.
cdf.exp2=2@Cdf.Exp@CDF.EXP(?,?)@CDF.EXP(c, escala). Numérico. Devuelve la probabilidad acumulada de que un valor de la distribución exponencial, con el parámetro de escala dado, sea menor que c.
cdf.f2=2@Cdf.F@CDF.F(?,?,?)@CDF.F(c, gl1, gl2). Numérico. Devuelve la probabilidad acumulada de que un valor de la distribución F, con los grados de libertad gl1 y gl2 dados, sea menor que c.
cdf.gamma2=2@Cdf.Gamma@CDF.GAMMA(?,?,?)@CDF.GAMMA(c, forma, escala). Numérico. Devuelve la probabilidad acumulada de que un valor de la distribución de Gamma, con los parámetros de forma y escala dados, sea menor que c.
cdf.geom2=2@Cdf.Geom@CDF.GEOM(?,?)@CDF.GEOM(c, p). Numérico. Devuelve la probabilidad acumulada de que el número de ensayos para obtener un éxito, cuando la probabilidad de éxito es la dada en p, sea menor o igual que c.
cdf.halfnrm2=2@Cdf.Halfnrm@CDF.HALFNRM(?)@CDF.HALFNRM(c, media, desv_típ). Numérico. Devuelve la probabilidad acumulada de que un valor de la distribución seminormal, con la media y desviación típica especificadas, sea menor que c.
cdf.hyper2=2@Cdf.Hyper@CDF.HYPER(?,?,?,?)@CDF.HYPER(c, total, muestra, aciertos). Numérico. Devuelve la probabilidad acumulada de que el número de objetos con una característica especificada, cuando los objetos de muestra se seleccionan aleatoriamente de un universo de tamaño igual a total en el que los aciertos tienen la característica especificada, sea menor o igual que c.
cdf.igauss2=2@Cdf.Igauss@CDF.IGAUSS(?,?,?)@CDF.IGAUSS(c, loc, escala). Numérico. Devuelve la probabilidad acumulada de que un valor de la distribución de Gauss inversa, con los parámetros de ubicación y escala dados, sea menor que c.
cdf.laplace2=2@Cdf.Laplace@CDF.LAPLACE(?,?,?)@CDF.LAPLACE(c, media, escala). Numérico. Devuelve la probabilidad acumulada de que un valor de la distribución de Laplace, con los parámetros de media y escala dados, sea menor que c.
cdf.lnormal2=2@Cdf.Lnormal@CDF.LNORMAL(?,?,?)@CDF.LNORMAL(c, a, b). Numérico. Devuelve la probabilidad acumulada de que un valor de la distribución log-normal, con los parámetros especificados, sea menor que c.
cdf.logistic2=2@Cdf.Logistic@CDF.LOGISTIC(?,?,?)@CDF.LOGISTIC(c, media, escala). Numérico. Devuelve la probabilidad acumulada de que un valor de la distribución logística, con los parámetros de media y escala dados, sea menor que c.
cdf.negbin2=2@Cdf.Negbin@CDF.NEGBIN(?,?,?)@CDF.NEGBIN(c, umbral, p). Numérico. Devuelve la probabilidad acumulada de que el número de ensayos para obtener un éxito, cuando el parámetro del umbral es umbral y la probabilidad de éxito es la dada en p, sea menor o igual que c.
cdf.normal2=2@Cdf.Normal@CDF.NORMAL(?,?,?)@CDF.NORMAL(c, media, desv_típ). Numérico. Devuelve la probabilidad acumulada de que un valor de la distribución normal, con la media y desviación típica especificadas, sea menor que c.
cdf.pareto2=2@Cdf.Pareto@CDF.PARETO(?,?,?)@CDF.PARETO(c, umbral, forma). Numérico. Devuelve la probabilidad acumulada de que un valor de la distribución de Pareto, con los parámetros de umbral y forma dados, sea menor que c.
cdf.poisson2=2@Cdf.Poisson@CDF.POISSON(?,?)@CDF.POISSON(c, media). Numérico. Devuelve la probabilidad acumulada de que un valor de la distribución de Poisson, con el parámetro de media o tasa especificado, sea menor o igual que c.
cdf.smod2=2@Cdf.Smod@CDF.SMOD(?)@CDF.SMOD(c, a, b). Numérico. Devuelve la probabilidad acumulada de que un valor del módulo máximo estudentizado, con los parámetros especificados, sea menor que c.
cdf.srange2=2@Cdf.Srange@CDF.SRANGE(?)@CDF.SRANGE(c, a, b). Numérico. Devuelve la probabilidad acumulada de que un valor del estadístico del rango estudentizado, con los parámetros especificados, sea menor que c.
cdf.t2=2@Cdf.T@CDF.T(?,?)@CDF.T(c, gl). Numérico. Devuelve la probabilidad acumulada de que un valor de la distribución t de Student, con los grados de libertad gl especificados, sea menor que c.
cdf.uniform2=2@Cdf.Uniform@CDF.UNIFORM(?,?,?)@CDF.UNIFORM(c, mín, máx). Numérico. Devuelve la probabilidad acumulada de que un valor de la distribución uniforme, con los parámetros mínimo y máximo dados, sea menor que c.
cdf.weibull2=2@Cdf.Weibull@CDF.WEIBULL(?,?,?)@CDF.WEIBULL(c, a, b). Numérico. Devuelve la probabilidad acumulada de que un valor de la distribución Weibull, con los parámetros especificados, sea menor que c.
cdfnorm2=2@Cdfnorm@CDFNORM(?)@CDFNORM(valorz). Numérico. Devuelve la probabilidad de que una variable aleatoria, con media 0 y desviación típica 1, sea menor que el valorz, que debe ser un valor numérico.
cfvar15=15@Cfvar@CFVAR(?,?)@CFVAR(expr_num, expr_num [,...]). Numérico. Devuelve el coeficiente de variación (la desviación típica dividida por la media) de los argumentos que tengan valores válidos. Esta función requiere dos o más argumentos que deben ser numéricos. Puede especificar el número mínimo de argumentos válidos para que esta función se evalúe.
char.index(2)16=16@Char.Index(2)@CHAR.INDEX(?,?)@CHAR.INDEX(cadena, subcadena[, divisor]). Numérico. Devuelve un número que indica la posición del carácter de la primera ocurrencia de la subcadena dentro de la cadena. El tercer argumento opcional, divisor, es un número de caracteres usado para dividir subcadena en cadenas distintas. Cada subcadena se usa para realizar búsquedas y la función devuelve la primera aparición de cualquier subcadena. Por ejemplo, CHAR.INDEX(var1, 'abcd') devolverá el valor de la posición inicial de la cadena completa "abcd" en la variable de cadena var1; CHAR.INDEX(var1, 'abcd', 1) devolverá el valor de la posición de la primera aparición de cualquier valor de la cadena; y CHAR.INDEX(var1, 'abcd', 2) devolverá el valor de la primera aparición de "ab" o "cd". El divisor debe ser un entero positivo y debe dividir exactamente la longitud de la subcadena. Devuelve 0 si la subcadena no aparece dentro de la cadena.
char.index(3)16=16@Char.Index(3)@CHAR.INDEX(?,?,?)@CHAR.INDEX(cadena, subcadena[, divisor]). Numérico. Devuelve un número que indica la posición del carácter de la primera ocurrencia de la subcadena dentro de la cadena. El tercer argumento opcional, divisor, es un número de caracteres usado para dividir subcadena en cadenas distintas. Cada subcadena se usa para realizar búsquedas y la función devuelve la primera aparición de cualquier subcadena. Por ejemplo, CHAR.INDEX(var1, 'abcd') devolverá el valor de la posición inicial de la cadena completa "abcd" en la variable de cadena var1; CHAR.INDEX(var1, 'abcd', 1) devolverá el valor de la posición de la primera aparición de cualquier valor de la cadena; y CHAR.INDEX(var1, 'abcd', 2) devolverá el valor de la primera aparición de "ab" o "cd". El divisor debe ser un entero positivo y debe dividir exactamente la longitud de la subcadena. Devuelve 0 si la subcadena no aparece dentro de la cadena.
char.index(2)13=13@Char.Index(2)@CHAR.INDEX(?,?)@CHAR.INDEX(cadena, subcadena[, divisor]). Numérico. Devuelve un número que indica la posición del carácter de la primera ocurrencia de la subcadena dentro de la cadena. El tercer argumento opcional, divisor, es un número de caracteres usado para dividir subcadena en cadenas distintas. Cada subcadena se usa para realizar búsquedas y la función devuelve la primera aparición de cualquier subcadena. Por ejemplo, CHAR.INDEX(var1, 'abcd') devolverá el valor de la posición inicial de la cadena completa "abcd" en la variable de cadena var1; CHAR.INDEX(var1, 'abcd', 1) devolverá el valor de la posición de la primera aparición de cualquier valor de la cadena; y CHAR.INDEX(var1, 'abcd', 2) devolverá el valor de la primera aparición de "ab" o "cd". El divisor debe ser un entero positivo y debe dividir exactamente la longitud de la subcadena. Devuelve 0 si la subcadena no aparece dentro de la cadena.
char.index(3)13=13@Char.Index(3)@CHAR.INDEX(?,?,?)@CHAR.INDEX(cadena, subcadena[, divisor]). Numérico. Devuelve un número que indica la posición del carácter de la primera ocurrencia de la subcadena dentro de la cadena. El tercer argumento opcional, divisor, es un número de caracteres usado para dividir subcadena en cadenas distintas. Cada subcadena se usa para realizar búsquedas y la función devuelve la primera aparición de cualquier subcadena. Por ejemplo, CHAR.INDEX(var1, 'abcd') devolverá el valor de la posición inicial de la cadena completa "abcd" en la variable de cadena var1; CHAR.INDEX(var1, 'abcd', 1) devolverá el valor de la posición de la primera aparición de cualquier valor de la cadena; y CHAR.INDEX(var1, 'abcd', 2) devolverá el valor de la primera aparición de "ab" o "cd". El divisor debe ser un entero positivo y debe dividir exactamente la longitud de la subcadena. Devuelve 0 si la subcadena no aparece dentro de la cadena.
char.length16=16@Char.Length@CHAR.LENGTH(?)@CHAR.LENGTH(expr_cadena). Numérico. Devuelve la longitud de expr_cadena en caracteres, sin los blancos finales.
char.lpad(2)16=16@Char.Lpad(2)@CHAR.LPAD(?,?)@CHAR.LPAD(expr_cadena, longitud[,expr_cadena2]). Cadena. Rellena expr_cadena1 por la izquierda para alcanzar la longitud especificada, utilizando la cadena opcional expr_cadena2 como cadena de relleno. El valor de la longitud representa el número de caracteres y debe ser un entero positivo. Si se omite el argumento opcional expr_cadena2, la cadena se completa con espacios en blanco.
char.lpad(3)16=16@Char.Lpad(3)@CHAR.LPAD(?,?,?)@CHAR.LPAD(expr_cadena, longitud[,expr_cadena2]). Cadena. Rellena expr_cadena1 por la izquierda para alcanzar la longitud especificada, utilizando la cadena opcional expr_cadena2 como cadena de relleno. El valor de la longitud representa el número de caracteres y debe ser un entero positivo. Si se omite el argumento opcional expr_cadena2, la cadena se completa con espacios en blanco.
char.mblen16=16@Char.Mblen@CHAR.mblen(?,?)@CHAR.MBLEN(expr_cadena,pos). Numérico. Devuelve el número de bytes en el carácter en la posición del carácter pos de expr_cadena.
char.rindex(2)16=16@Char.Rindex(2)@CHAR.RINDEX(?,?)@CHAR.RINDEX(cadena, subcadena[,divisor]). Numérico. Devuelve un entero que indica la posición inicial de la posición del carácter de la última aparición de la subcadena en la cadena. El tercer argumento opcional, divisor, es el número de caracteres usado para dividir subcadena en cadenas distintas. Por ejemplo, CHAR.RINDEX(var1, 'abcd') devolverá el valor de la posición inicial de la última aparición de la cadena completa "abcd" en la variable var1; CHAR.RINDEX(var1, 'abcd', 1) devolverá el valor de la posición de la última aparición de cualquier valor de la cadena; y CHAR.RINDEX(var1, 'abcd', 2) devolverá el valor de la posición inicial de la última aparición de "ab" o "cd". El divisor debe ser un entero positivo y debe dividir exactamente la longitud de la subcadena. Si no se encuentra la subcadena, devuelve el valor 0.
char.rindex(3)16=16@Char.Rindex(3)@CHAR.RINDEX(?,?,?)@CHAR.RINDEX(cadena, subcadena[,divisor]). Numérico. Devuelve un entero que indica la posición inicial de la posición del carácter de la última aparición de la subcadena en la cadena. El tercer argumento opcional, divisor, es el número de caracteres usado para dividir subcadena en cadenas distintas. Por ejemplo, CHAR.RINDEX(var1, 'abcd') devolverá el valor de la posición inicial de la última aparición de la cadena completa "abcd" en la variable var1; CHAR.RINDEX(var1, 'abcd', 1) devolverá el valor de la posición de la última aparición de cualquier valor de la cadena; y CHAR.RINDEX(var1, 'abcd', 2) devolverá el valor de la posición inicial de la última aparición de "ab" o "cd". El divisor debe ser un entero positivo y debe dividir exactamente la longitud de la subcadena. Si no se encuentra la subcadena, devuelve el valor 0.
char.rindex(2)13=13@Char.Rindex(2)@CHAR.RINDEX(?,?)@CHAR.RINDEX(cadena, subcadena[,divisor]). Numérico. Devuelve un entero que indica la posición inicial de la posición del carácter de la última aparición de la subcadena en la cadena. El tercer argumento opcional, divisor, es el número de caracteres usado para dividir subcadena en cadenas distintas. Por ejemplo, CHAR.RINDEX(var1, 'abcd') devolverá el valor de la posición inicial de la última aparición de la cadena completa "abcd" en la variable var1; CHAR.RINDEX(var1, 'abcd', 1) devolverá el valor de la posición de la última aparición de cualquier valor de la cadena; y CHAR.RINDEX(var1, 'abcd', 2) devolverá el valor de la posición inicial de la última aparición de "ab" o "cd". El divisor debe ser un entero positivo y debe dividir exactamente la longitud de la subcadena. Si no se encuentra la subcadena, devuelve el valor 0.
char.rindex(3)13=13@Char.Rindex(3)@CHAR.RINDEX(?,?,?)@CHAR.RINDEX(cadena, subcadena[,divisor]). Numérico. Devuelve un entero que indica la posición inicial de la posición del carácter de la última aparición de la subcadena en la cadena. El tercer argumento opcional, divisor, es el número de caracteres usado para dividir subcadena en cadenas distintas. Por ejemplo, CHAR.RINDEX(var1, 'abcd') devolverá el valor de la posición inicial de la última aparición de la cadena completa "abcd" en la variable var1; CHAR.RINDEX(var1, 'abcd', 1) devolverá el valor de la posición de la última aparición de cualquier valor de la cadena; y CHAR.RINDEX(var1, 'abcd', 2) devolverá el valor de la posición inicial de la última aparición de "ab" o "cd". El divisor debe ser un entero positivo y debe dividir exactamente la longitud de la subcadena. Si no se encuentra la subcadena, devuelve el valor 0.
char.rpad(2)16=16@Char.Rpad(2)@CHAR.RPAD(?,?)@CHAR.RPAD(expr_cadena1,longitud[,expr_cadena2]). Cadena. Rellena expr_cadena1 por la derecha con expr_cadena2 para alcanzar la longitud especificada, utilizando tantas copias completas como sea necesario de expr_cadena2, como cadena de relleno. El valor de la longitud representa el número de caracteres y debe ser un entero positivo. El tercer argumento opcional, expr_cadena2 es un carácter único entre comillas o una expresión que da como resultado una cadena. Si expr_cadena2 se omite, el valor se completa con espacios en blanco.
char.rpad(3)16=16@Char.Rpad(3)@CHAR.RPAD(?,?,?)@CHAR.RPAD(expr_cadena1,longitud[,expr_cadena2]). Cadena. Rellena expr_cadena1 por la derecha con expr_cadena2 para alcanzar la longitud especificada, utilizando tantas copias completas como sea necesario de expr_cadena2, como cadena de relleno. El valor de la longitud representa el número de caracteres y debe ser un entero positivo. El tercer argumento opcional, expr_cadena2 es un carácter único entre comillas o una expresión que da como resultado una cadena. Si expr_cadena2 se omite, el valor se completa con espacios en blanco.
char.substr(2)16=16@Char.Substr(2)@CHAR.SUBSTR(?,?)@CHAR.SUBSTR(expr_cadena,pos[,longitud]). Cadena. Devuelve una subcadena que empieza en la posición del carácter pos de expr_cadena. El tercer argumento opcional representa el número de caracteres de la subcadena. Si se omite el argumento opcional longitud, devuelve la subcadena que comienza en la posición del carácter pos de expr_cadena hasta el final de expr_cadena. Por ejemplo CHAR.SUBSTR('abcd', 2) devuelve 'bcd' y CHAR.SUBSTR('abcd', 2, 2) devuelve 'bc'.
char.substr(3)16=16@Char.Substr(3)@CHAR.SUBSTR(?,?,?)@CHAR.SUBSTR(expr_cadena,pos[,longitud]). Cadena. Devuelve una subcadena que empieza en la posición del carácter pos de expr_cadena. El tercer argumento opcional representa el número de caracteres de la subcadena. Si se omite el argumento opcional longitud, devuelve la subcadena que comienza en la posición del carácter pos de expr_cadena hasta el final de expr_cadena. Por ejemplo CHAR.SUBSTR('abcd', 2) devuelve 'bcd' y CHAR.SUBSTR('abcd', 2, 2) devuelve 'bc'.
concat16=16@Concat@CONCAT(?,?)@CONCAT(expr_cadena,expr_cadena[,..]). Cadena. Devuelve una cadena que es la concatenación de todos los argumentos, que deben ser cadenas. Esta función requiere dos o más argumentos. En modo de página de código, si expr_cadena es una variable de cadena, utilice RTRIM si sólo desea el valor de cadena real sin el relleno por la derecha de la anchura de la variable definida. Por ejemplo, CONCAT(RTRIM(var_cadena1), RTRIM(var_cadena2)).
cos1=1@Cos@COS(?)@COS(radianes). Numérico. Devuelve el coseno de radianes, que debe ser un valor numérico, medido en radianes.
ctime.days18=18@Ctime.Days@CTIME.DAYS(?)@CTIME.DAYS(valortiempo). Numérico. Devuelve el número de días, incluyendo fracciones de día, que hay en valortiempo, que debe ser un número de segundos, una expresión de tiempo o una variable en formato de tiempo.
ctime.hours18=18@Ctime.Hours@CTIME.HOURS(?)@CTIME.HOURS(valortiempo). Numérico. Devuelve el número de horas, incluyendo fracciones de hora, que hay en valortiempo, que debe ser un número de segundos, una expresión de tiempo o una variable en formato de tiempo.
ctime.minutes18=18@Ctime.Minutes@CTIME.MINUTES(?)@CTIME.MINUTES(valortiempo). Numérico. Devuelve el número de minutos, incluyendo fracciones de minutos, que hay en valortiempo, que debe ser un número de segundos, una expresión de tiempo o una variable en formato de tiempo.
ctime.seconds18=18@Ctime.Seconds@CTIME.SECONDS(?)@CTIME.SECONDS(valortiempo). Numérico. Devuelve el número de segundos, incluyendo las fracciones de segundo, en valortiempo, que debe ser un número, una expresión de tiempo o una variable con formato de tiempo.
date.dmy6=6@Date.Dmy@DATE.DMY(?,?,?)@DATE.DMY(día, mes, año). Numérico. Devuelve un valor de fecha correspondiente al día, mes y año indicados. Los argumentos deben ser evaluados como enteros. El día debe estar entre 1 y 31, el mes entre 1 y 13, y, por último, el año debe ser un entero de cuatro dígitos mayor que 1582. Para mostrar el resultado como una fecha, asigne un formato de fecha a la variable de resultado.
date.mdy6=6@Date.Mdy@DATE.MDY(?,?,?)@DATE.MDY(mes,día,año). Numérico. Devuelve un valor de fecha correspondiente al mes, día y año indicados. Los argumentos deben ser evaluados como enteros. El día debe estar entre 1 y 31, el mes entre 1 y 13, y, por último, el año debe ser un entero de cuatro dígitos mayor que 1582. Para mostrar el resultado como una fecha, asigne un formato de fecha a la variable de resultado.
date.moyr6=6@Date.Moyr@DATE.MOYR(?,?)@DATE.MOYR(mes,año). Numérico. Devuelve un valor de fecha correspondiente al mes y año indicados. Los argumentos deben ser evaluados como enteros. El mes debe estar entre 1 y 13 y el año debe ser un entero de cuatro dígitos mayor que 1582. Para mostrar el resultado como una fecha, asigne un formato de fecha a la variable de resultado.
date.qyr6=6@Date.Qyr@DATE.QYR(?,?)@DATE.QYR(trimestre,año). Numérico. Devuelve un valor de fecha correspondiente al trimestre y año indicados. Los argumentos deben ser evaluados como enteros. El trimestre debe estar entre 1 y 4 y el año debe ser un entero de cuatro dígitos mayor que 1582. Para mostrar el resultado como una fecha, asigne un formato de fecha a la variable de resultado.
date.wkyr6=6@Date.Wkyr@DATE.WKYR(?,?)@DATE.WKYR(núm_semana, año). Numérico. Devuelve un valor de fecha correspondiente al núm_semana y año indicados. Los argumentos deben ser evaluados como enteros. El valor núm_semana debe estar entre 1 y 53 y el año debe ser un entero de cuatro dígitos mayor que 1582. El valor de fecha devuelto representa el primer día de la semana señalada para ese año. La primera semana empieza el 1 de enero de cada año; por lo que la fecha devuelta para cualquier valor de semana concreta será diferente de un año a otro.Para mostrar el resultado como una fecha, aplique un formato de fecha a la variable del resultado.
date.yrday6=6@Date.Yrday@DATE.YRDAY(?,?)@DATE.YRDAY(año, núm_día). Numérico. Devuelve un valor de fecha correspondiente al año y núm_día indicados. Los argumentos deben ser evaluados como enteros. El valor núm_día debe estar entre 1 y 366 y el año debe ser un entero de cuatro dígitos mayor que 1582. Para mostrar el resultado como una fecha, asigne un formato de fecha a la variable de resultado.
datediff5=5@Datediff@DATEDIFF(?,?,?)@DATEDIFF(momento_fecha2, momento_fecha1, "unidad"). Numérico. Calcula la diferencia entre dos valores de fecha/tiempo y devuelve un entero (con cualquier componente fraccional truncado) en las unidades de fecha/tiempo especificadas, donde momento_fecha2 y momento_fecha1 son variables en formato de fecha o tiempo (o valores numéricos que representen valores válidos de fecha/tiempo) y "unidad" es uno de los siguientes valores literales de cadena, entre comillas: years, quarters, months, weeks, days, hours, minutes, seconds.
datesum(3)5=5@Datesum(3)@DATESUM(?,?,?)@DATESUM(momento_fecha, valor, "unidad", "método"). Numérico. Calcula un valor de fecha o tiempo a un número especificado de unidades de un valor de fecha o tiempo dado, donde momento_fecha es una variable en formato de fecha o tiempo (o un valor numérico que represente un valor válido de fecha/tiempo) y "unidad" es una de las siguientes cadenas literales, entre comillas: years, quarters, months, weeks, days, hours, minutes, seconds. El método opcional, entrecomillado, puede ser "rollover" o "closest". El método "rollover" pasa los días de exceso al siguiente mes. El método "closest" utiliza la fecha legítima más próxima dentro del mes; se utiliza por defecto. El valor devuelto es una fecha/tiempo expresada en segundos. Para mostrar el valor como una fecha/tiempo debe asignarse el formato adecuado a la variable.
datesum(4)5=5@Datesum(4)@DATESUM(?,?,?,?)@DATESUM(momento_fecha, valor, "unidad", "método"). Numérico. Calcula un valor de fecha o tiempo a un número especificado de unidades de un valor de fecha o tiempo dado, donde momento_fecha es una variable en formato de fecha o tiempo (o un valor numérico que represente un valor válido de fecha/tiempo) y "unidad" es una de las siguientes cadenas literales, entre comillas: years, quarters, months, weeks, days, hours, minutes, seconds. El método opcional, entrecomillado, puede ser "rollover" o "closest". El método "rollover" pasa los días de exceso al siguiente mes. El método "closest" utiliza la fecha legítima más próxima dentro del mes; se utiliza por defecto. El valor devuelto es una fecha/tiempo expresada en segundos. Para mostrar el valor como una fecha/tiempo debe asignarse el formato adecuado a la variable.
exp1=1@Exp@EXP(?)@EXP(expr_num). Numérico. Devuelve e elevado a la potencia expr_num, siendo e la base de los logaritmos naturales y expr_num un valor numérico. Si expr_num es muy grande los resultados pueden exceder la capacidad máxima de la máquina.
idf.beta8=8@Idf.Beta@IDF.BETA(?,?,?)@IDF.BETA(p, forma1, forma2). Numérico. Devuelve el valor de la distribución Beta, con los parámetros de forma especificados cuya probabilidad acumulada es p.
idf.cauchy8=8@Idf.Cauchy@IDF.CAUCHY(?,?,?)@IDF.CAUCHY(prob, loc, escala). Numérico. Devuelve el valor de la distribución Cauchy, con los parámetros de ubicación y escala dados, para el que la probabilidad acumulada es p.
idf.chisq8=8@Idf.Chisq@IDF.CHISQ(?,?)@IDF.CHISQ(p, gl). Numérico. Devuelve el valor de la distribución chi-cuadrado, con los grados de libertad especificados, para el cual la probabilidad acumulada es p. Por ejemplo, el valor de chi-cuadrado que es significativo al nivel 0,05 con 3 grados de libertad es IDF.CHISQ(0.95,3).
idf.exp8=8@Idf.Exp@IDF.EXP(?,?)@IDF.EXP(p, escala). Numérico. Devuelve el valor de una variable con un decrecimiento exponencial y con una tasa de decrecimiento escala, cuya probabilidad acumulada es p.
idf.f8=8@Idf.F@IDF.F(?,?,?)@IDF.F(p, gl1, gl2). Numérico. Devuelve el valor de la distribución F, con los grados de libertad especificados, para el cual la probabilidad acumulada es p. Por ejemplo, el valor de F que es significativo al nivel 0,05 con 3 y 100 grados de libertad es IDF.F(0.95,3,100).
idf.gamma8=8@Idf.Gamma@IDF.GAMMA(?,?,?)@IDF.GAMMA(p, forma, escala). Numérico. Devuelve el valor de la distribución Gamma, con los parámetros de forma especificada y escala dados, para el que la probabilidad acumulada es p.
idf.halfnrm8=8@Idf.Halfnrm@IDF.HALFNRM(?)@IDF.HALFNRM(p, media, desv_típ). Numérico. Devuelve el valor de la distribución seminormal, con la media y desviación típica especificadas, para el que la probabilidad acumulada es p.
idf.igauss8=8@Idf.Igauss@IDF.IGAUSS(?,?,?)@IDF.IGAUSS(p, loc, escala). Numérico. Devuelve el valor de la distribución de Gauss inversa, con los parámetros de ubicación y escala dados, para el que la probabilidad acumulada es p.
idf.laplace8=8@Idf.Laplace@IDF.LAPLACE(?,?,?)@IDF.LAPLACE(p, media, escala). Numérico. Devuelve el valor de la distribución Laplace, con los parámetros de media especificada y escala dados, para el que la probabilidad acumulada es p.
idf.lnormal8=8@Idf.Lnormal@IDF.LNORMAL(?,?,?)@IDF.LNORMAL(p, a, b). Numérico. Devuelve el valor de la distribución log-normal, con los parámetros especificados cuya probabilidad acumulada es p.
idf.logistic8=8@Idf.Logistic@IDF.LOGISTIC(?,?,?)@IDF.LOGISTIC(p, media, escala). Numérico. Devuelve el valor de la distribución logística, con los parámetros de media especificada y escala dados, cuya probabilidad acumulada es p.
idf.normal8=8@Idf.Normal@IDF.NORMAL(?,?,?)@IDF.NORMAL(p, media, desv_típ). Numérico. Devuelve el valor de la distribución normal, con la media y desviación típica especificadas, cuya probabilidad acumulada es p.
idf.pareto8=8@Idf.Pareto@IDF.PARETO(?,?,?)@IDF.PARETO(p, umbral, forma). Numérico. Devuelve el valor de la distribución Pareto, con los parámetros de umbral y escala dados, cuya probabilidad acumulada es p.
idf.smod8=8@Idf.Smod@IDF.SMOD(?)@IDF.SMOD(p, a, b). Numérico. Devuelve el valor del módulo máximo estudentizado, con los parámetros especificados cuya probabilidad acumulada es p.
idf.srange8=8@Idf.Srange@IDF.SRANGE(?)@IDF.SRANGE(p, a, b). Numérico. Devuelve el valor del estadístico del rango estudentizado, con los parámetros especificados cuya probabilidad acumulada es p.
idf.t8=8@Idf.T@IDF.T(?,?)@IDF.T(p, gl). Numérico. Devuelve el valor de la distribución t de Student, con los grados de libertad especificados, cuya probabilidad acumulada es p.
idf.uniform8=8@Idf.Uniform@IDF.UNIFORM(?,?,?)@IDF.UNIFORM(p, mín, máx). Numérico. Devuelve el valor de la distribución uniforme, entre mín y máx cuya probabilidad acumulada es p.
idf.weibull8=8@Idf.Weibull@IDF.WEIBULL(?,?,?)@IDF.WEIBULL(p, a, b). Numérico. Devuelve el valor de la distribución Weibull, con los parámetros especificados cuya probabilidad acumulada es p.
lag(1)9=9@Lag(1)@LAG(?)@LAG(variable[, n]). Numérico o cadena. El valor de la variable del caso anterior o n casos antes. El segundo argumento opcional, n, debe ser un entero positivo; el valor por defecto es 1. Por ejemplo, prev4=LAG(gnp,4) devuelve el valor de gnp para el cuarto casi anterior al actual. Los primeros cuatro casos tienen valores perdidos por el sistema para prev4.
lag(2)9=9@Lag(2)@LAG(?,?)@LAG(variable[, n]). Numérico o cadena. El valor de la variable del caso anterior o n casos antes. El segundo argumento opcional, n, debe ser un entero positivo; el valor por defecto es 1. Por ejemplo, prev4=LAG(gnp,4) devuelve el valor de gnp para el cuarto casi anterior al actual. Los primeros cuatro casos tienen valores perdidos por el sistema para prev4.
length16=16@Length@LENGTH(?)@LENGTH(expr_cadena). Numérico. Devuelve la longitud de expr_cadena, que debe ser una expresión de cadena. Para variables de cadena, en modo Unicode, es el número de bytes de cada valor, excluyendo los espacios en blanco. En modo de página de códigos es la longitud de variable definida, incluyendo los espacios en blanco. Para obtener la longitud sin los espacios en blanco precedentes, utilice LENGTH(RTRIM(expr_cadena)).
lg101=1@Lg10@LG10(?)@LG10(expr_num). Numérico. Devuelve el logaritmo en base 10 de la expr_num, que debe ser numérica y mayor que 0.
ln1=1@Ln@LN(?)@LN(expr_num). Numérico. Devuelve el logaritmo en base e de la expr_num, que debe ser numérica y mayor que 0.
lngamma1=1@Lngamma@LNGAMMA(?)@LNGAMMA(expr_num). Numérico. Devuelve el logaritmo de la función completa Gamma de expr_num, que debe ser numérica y mayor que 0.
lower16=16@Lower@LOWER(?)@LOWER(expr_cadena). Cadena. Devuelve expr_cadena en minúsculas y otros caracteres sin modificar. El argumento puede ser una variable de cadena o un valor. Por ejemplo, LOWER(nombre1) devuelve carlos si el valor de nombre1 es Carlos.
ltrim(1)16=16@Ltrim(1)@LTRIM(?)@LTRIM(expr_cadena[, carácter]). Cadena. Devuelve expr_cadena de la que se elimina cualquier instancia inicial de carácter. Si no se especifica char, se eliminan los blancos iniciales. El carácter debe evaluarse como un único carácter.
ltrim(2)16=16@Ltrim(2)@LTRIM(?,?)@LTRIM(expr_cadena[, carácter]). Cadena. Devuelve expr_cadena de la que se elimina cualquier instancia inicial de carácter. Si no se especifica char, se eliminan los blancos iniciales. El carácter debe evaluarse como un único carácter.
max13=13@Max@MAX(?,?)@MAX(valor, valor[,..]). Numérico o cadena. Compara los argumentos y devuelve como resultado el mayor de los que tengan valores válidos. Esta función requiere dos o más argumentos. Para valores numéricos, puede especificar el número mínimo de argumentos válidos para que esta función se evalúe.
max15=15@Max@MAX(?,?)@MAX(valor, valor[,..]). Numérico o cadena. Compara los argumentos y devuelve como resultado el mayor de los que tengan valores válidos. Esta función requiere dos o más argumentos. Para valores numéricos, puede especificar el número mínimo de argumentos válidos para que esta función se evalúe.
mblen.byte16=16@Mblen.Byte@MBLEN.BYTE(?,?)@MBLEN.BYTE(expr_cadena,pos). Numérico. Devuelve el número de bytes en el carácter para la posición de byte en la expresión de cadena.
mean15=15@Mean@MEAN(?,?)@MEAN(expr_num, expr_num[,..]). Numérico. Devuelve la media aritmética de sus argumentos que contienen valores válidos y no perdidos. Esta función requiere dos o más argumentos que deben ser numéricos. Puede especificar el número mínimo de argumentos válidos para que esta función se evalúe.
median15=15@Median@Median(?,?)@MEDIANA(expr_num, expr_num[,..]). Numérico. Devuelve la mediana aritmética (percentil 50) de sus argumentos que contienen valores válidos y no perdidos. Esta función requiere dos o más argumentos que deben ser numéricos. Puede especificar el número mínimo de argumentos válidos para que esta función se evalúe.
min13=13@Min@MIN(?,?)@MIN(valor,valor[,..]). Numérico o cadena. Devuelve el valor mínimo de sus argumentos que contienen valores válidos y no perdidos. Esta función requiere dos o más argumentos. Para valores numéricos, puede especificar el número mínimo de argumentos válidos para que esta función se evalúe.
min15=15@Min@MIN(?,?)@MIN(valor,valor[,..]). Numérico o cadena. Devuelve el valor mínimo de sus argumentos que contienen valores válidos y no perdidos. Esta función requiere dos o más argumentos. Para valores numéricos, puede especificar el número mínimo de argumentos válidos para que esta función se evalúe.
missing10=10@Missing@MISSING(?)@MISSING(variable). Lógico. Devuelve 1 o verdadero si la variable tiene un valor perdido. El argumento debe ser un nombre de variable del conjunto de datos activo.
mod1=1@Mod@MOD(?,?)@MOD(expr_num,módulo). Numérico. Devuelve el resto que resulta de dividir expr_num por el módulo. Ambos argumentos deben ser numéricos. El módulo no puede ser 0.
ncdf.beta2=2@Ncdf.Beta@NCDF.BETA(?,?,?,?)@NCDF.BETA(c, forma1, forma2, nc). Numérico. Devuelve la probabilidad acumulada de que un valor de la distribución Beta no centrada, con los parámetros de forma y no centralidad dados, sea menor que la cantidad c.
ncdf.chisq2=2@Ncdf.Chisq@NCDF.CHISQ(?,?,?)@NCDF.CHISQ(c, gl,nc). Numérico. Devuelve la probabilidad acumulada de que un valor de la distribución de chi-cuadrado no centrada, con los grados de libertad gl y el parámetro de no centralidad nc dados, sea menor que la cantidad c.
ncdf.f2=2@Ncdf.F@NCDF.F(?,?,?,?)@NCDF.F(c, gl1, gl2, nc). Numérico. Devuelve la probabilidad acumulada de que un valor de la distribución F no centrada, con los grados de libertad gl1 y gl2 y el parámetro de no centralidad nc dados, sea menor que la cantidad c.
ncdf.t2=2@Ncdf.T@NCDF.T(?,?,?)@NCDF.T(c, gl, nc). Numérico. Devuelve la probabilidad acumulada de que un valor de la distribución t de Student no centrada, con los grados de libertad gl y el parámetro de no centralidad nc dados, sea menor que la cantidad c.
nmiss10=10@Nmiss@NMISS(?)@NMISS(variable[,..]). Numérico. Devuelve un recuento de los argumentos que presentan valores perdidos del sistema y por el usuario. Esta función requiere uno o más argumentos, que deben ser nombres de variables en el conjunto de datos activo.
normalize16=16@Normalize@NORMALIZE(?)@NORMALIZE(strexp). Cadena. Devuelve la versión normalizada de strexp. En modo Unicode, devuelve Unicode NFC. En modo de página de códigos no tiene ningún efecto y devuelve strexp sin modificar. La longitud del resultado puede ser diferente de la longitud de la entrada.
npdf.beta11=11@Npdf.Beta@NPDF.BETA(?,?,?,?)@NPDF.BETA(c, forma1, forma2, nc). Numérico. Devuelve la densidad de probabilidad de la distribución beta no centrada, con los parámetros de forma y no centralidad dados, en c.
npdf.chisq11=11@Npdf.Chisq@NPDF.CHISQ(?,?,?)@NPDF.CHISQ(c, gl, nc). Numérico. Devuelve la densidad de probabilidad de la distribución chi-cuadrado no centrada, con los grados de libertad gl y el parámetro de no centralidad especificados en c.
npdf.f11=11@Npdf.F@NPDF.F(?,?,?,?)@NPDF.F(c, gl1, gl2, nc). Numérico. Devuelve la densidad de probabilidad de la distribución F, con grados de libertad gl1 y gl2 y la no centralidad nc, en c.
npdf.t11=11@Npdf.T@NPDF.T(?,?,?)@NPDF.T(c, gl, nc). Numérico. Devuelve la densidad de probabilidad de la distribución t de Student no centrada, con grados de libertad gl y no centralidad nc, en c.
ntrim16=16@Ntrim@NTRIM(?)@NTRIM(nombre_var). Devuelve el valor de nombre_var, sin eliminar los espacios en blanco precedentes. El valor de nombre_var debe ser un nombre de variable; no puede ser una expresión.
number3=3@Number@NUMBER(?,?)@NUMBER(expr_cadena, formato). Numérico. Devuelve el valor de la expresión de cadena expr_cadena como un número. El segundo argumento, formato, es el formato numérico utilizado para leer expr_cadena. Por ejemplo, NUMBER(cadena_Fecha, FECHA11) convierte las cadenas que contienen fechas del formato general dd-mmm-aaaa a un valor numérico de segundos que representa esa fecha. (Para mostrar el valor como fecha, utilice el comando FORMATS o PRINT FORMATS.) Si la cadena no se puede leer con el formato, esta función devuelve los valores perdidos por el sistema.
nvalid10=10@Nvalid@NVALID(?)@NVALID(variable [, ...]). Numérico. Devuelve un recuento de argumentos que contiene valores válidos y no perdidos. Esta función requiere uno o más argumentos, que deben ser nombres de variables en el conjunto de datos activo.
pdf.bernoulli11=11@Pdf.Bernoulli@PDF.BERNOULLI(?,?)@PDF.BERNOULLI(c, p). Numérico. Devuelve la probabilidad de que un valor de la distribución de Bernoulli, con el parámetro de probabilidad dado, sea igual a c.
pdf.beta11=11@Pdf.Beta@PDF.BETA(?,?,?)@PDF.BETA(c, forma1, forma2). Numérico. Devuelve la densidad de probabilidad de la distribución beta, con los parámetros de forma dados, en c.
pdf.binom11=11@Pdf.Binom@PDF.BINOM(?,?,?)@PDF.BINOM(c, n, p). Numérico. Devuelve la probabilidad de que el número de éxitos en n ensayos, con probabilidad de éxito p en cada uno de ellos, sea igual a c. Cuando n es 1, el valor es el mismo que el de PDF.BERNOULLI.
pdf.bvnor11=11@Pdf.Bvnor@PDF.BVNOR(?,?,?)@PDF.BVNOR(c1, c2, r). Numérico. Devuelve la densidad de probabilidad de la distribución normal típica bivariante, con el parámetro de correlación dado, en c1, c2.
pdf.cauchy11=11@Pdf.Cauchy@PDF.CAUCHY(?,?,?)@PDF.CAUCHY(c, loc, escala). Numérico. Devuelve densidad de probabilidad de la distribución de Cauchy, con los parámetros de ubicación y escala dados, en c.
pdf.chisq11=11@Pdf.Chisq@PDF.CHISQ(?,?)@PDF.CHISQ(c, gl). Numérico. Devuelve la densidad de probabilidad de la distribución chi-cuadrado, con grados de libertad gl, en c.
pdf.exp11=11@Pdf.Exp@PDF.EXP(?,?)@PDF.EXP(c, escala). Numérico. Devuelve la densidad de probabilidad de la distribución exponencial, con un parámetro de escala determinado, en c.
pdf.f11=11@Pdf.F@PDF.F(?,?,?)@PDF.F(cant, gl1, gl2). Numérico. Devuelve la densidad de probabilidad de la distribución F, con grados de libertad gl1 y gl2, en c.
pdf.gamma11=11@Pdf.Gamma@PDF.GAMMA(?,?,?)@PDF.GAMMA(c, forma, escala). Numérico. Devuelve la densidad de probabilidad de la distribución Gamma, con los parámetros de forma y escala dados, en c.
pdf.geom11=11@Pdf.Geom@PDF.GEOM(?,?)@PDF.GEOM(c, p). Numérico. Devuelve la probabilidad de que el número de ensayos para obtener un éxito sea igual a c, cuando la probabilidad de éxito es la dada en p.
pdf.halfnrm11=11@Pdf.Halfnrm@PDF.HALFNRM(?,?,?)@PDF.HALFNRM(c, media, desv_típ). Numérico. Devuelve la densidad de probabilidad de la distribución seminormal, con la media y desviación típica especificadas, en c.
pdf.hyper11=11@Pdf.Hyper@PDF.HYPER(?,?,?,?)@PDF.HYPER(c, total, muestra, aciertos). Numérico. Devuelve la probabilidad de que el número de objetos con una característica especificada, cuando los objetos de muestra se seleccionan aleatoriamente de un universo de tamaño igual a total en el que los aciertos tienen la característica especificada, sea igual a c.
pdf.igauss11=11@Pdf.Igauss@PDF.IGAUSS(?,?,?)@PDF.IGAUSS(c, loc, escala). Numérico. Devuelve la densidad de probabilidad de la distribución de Gauss inversa, con los parámetros de ubicación y escala dados, en c.
pdf.laplace11=11@Pdf.Laplace@PDF.LAPLACE(?,?,?)@PDF.LAPLACE(c, media, escala). Numérico. Devuelve la densidad de probabilidad de la distribución de Laplace, con los parámetros de media y escala especificados, en c.
pdf.lnormal11=11@Pdf.Lnormal@PDF.LNORMAL(?,?,?)@PDF.LNORMAL(c, a, b). Numérico. Devuelve la densidad de probabilidad de la distribución log-normal, con los parámetros especificados, en c.
pdf.logistic11=11@Pdf.Logistic@PDF.LOGISTIC(?,?,?)@PDF.LOGISTIC(c, media, escal). Numérico. Devuelve la densidad de probabilidad de la distribución logística, con los parámetros de media y escala especificados, en c.
pdf.negbin11=11@Pdf.Negbin@PDF.NEGBIN(?,?,?)@PDF.NEGBIN(c, umbral, p). Numérico. Devuelve la probabilidad de que el número de ensayos para obtener un éxito sea igual a c, cuando el parámetro del umbral es umbral y la probabilidad de éxito es la dada en p.
pdf.normal11=11@Pdf.Normal@PDF.NORMAL(?,?,?)@PDF.NORMAL(c, media, desv_típ). Numérico. Devuelve la densidad de probabilidad de la distribución normal, con la media y desviación típica especificadas, en c.
pdf.pareto11=11@Pdf.Pareto@PDF.PARETO(?,?,?)@PDF.PARETO(c, umbral, forma). Numérico. Devuelve la densidad de probabilidad de la distribución de Pareto, con los parámetros de umbral y forma especificados, en c.
pdf.poisson11=11@Pdf.Poisson@PDF.POISSON(?,?)@PDF.POISSON(c, media). Numérico. Devuelve la probabilidad de que un valor de la distribución de Poisson, con el parámetro de media o tasa especificado, sea igual a c.
pdf.t11=11@Pdf.T@PDF.T(?,?)@PDF.T(c, gl). Numérico. Devuelve la densidad de probabilidad de la distribución t de Student, con los gl grados de libertad especificados, en c.
pdf.uniform11=11@Pdf.Uniform@PDF.UNIFORM(?,?,?)@PDF.UNIFORM(c, mín, máx). Numérico. Devuelve la densidad de probabilidad de la distribución uniforme, con el mínimo y máximo especificados, en c.
pdf.weibull11=11@Pdf.Weibull@PDF.WEIBULL(?,?,?)@PDF.WEIBULL(c, a, b). Numérico. Devuelve la densidad de probabilidad de la distribución de Weibull, con los parámetros especificados, en c.
range13=13@Range@RANGE(?,?,?)@RANGE(prueba, menor, mayor[, menor, mayor, ...]). Lógico. Devuelve 1, o verdadero, si prueba se encuentra dentro de cualquiera de los rangos inclusivos, definidos por los pares menor, mayor. Todos los argumentos deben ser numéricos, o todas las cadenas de la misma longitud, y cada uno de los pares menor-mayor debe estar ordenado de menor a mayor Nota: En el caso de los valores de cadena, los resultados pueden variar según la configuración regional incluso en un mismo conjunto de caracteres, ya que se utiliza la secuencia de clasificación nacional. Es el orden en el idioma y no el orden ASCII el que establece el lugar de la secuencia en que recaen algunos caracteres.
replace(3)13=13@Replace(3)@REPLACE(?,?,?)@REPLACE(a1, a2, a3[, a4]). Cadena. Se sustituyen en a1 las apariciones de a2 con el valor a3. El argumento opcional a4 especifica el número de apariciones que se sustituyen; si se omite a4 se sustituyen todas las apariciones. Los argumentos a1, a2 y a3 deben resolverse a valores de cadena (cadenas literales entrecomilladas o variables de cadena) y el argumento opcional a4 debe resolverse a un entero no negativo. Por ejemplo, REPLACE("abcabc", "a", "x") devuelve un valor "xbcxbc" y REPLACE("abcabc", "a", "x", 1) devuelve un valor "xbcabc".
replace(4)13=13@Replace(4)@REPLACE(?,?,?,?)@REPLACE(a1, a2, a3[, a4]). Cadena. Se sustituyen en a1 las apariciones de a2 con el valor a3. El argumento opcional a4 especifica el número de apariciones que se sustituyen; si se omite a4 se sustituyen todas las apariciones. Los argumentos a1, a2 y a3 deben resolverse a valores de cadena (cadenas literales entrecomilladas o variables de cadena) y el argumento opcional a4 debe resolverse a un entero no negativo. Por ejemplo, REPLACE("abcabc", "a", "x") devuelve un valor "xbcxbc" y REPLACE("abcabc", "a", "x", 1) devuelve un valor "xbcabc".
replace(3)16=16@Replace(3)@REPLACE(?,?,?)@REPLACE(a1, a2, a3[, a4]). Cadena. Se sustituyen en a1 las apariciones de a2 con el valor a3. El argumento opcional a4 especifica el número de apariciones que se sustituyen; si se omite a4 se sustituyen todas las apariciones. Los argumentos a1, a2 y a3 deben resolverse a valores de cadena (cadenas literales entrecomilladas o variables de cadena) y el argumento opcional a4 debe resolverse a un entero no negativo. Por ejemplo, REPLACE("abcabc", "a", "x") devuelve un valor "xbcxbc" y REPLACE("abcabc", "a", "x", 1) devuelve un valor "xbcabc".
replace(4)16=16@Replace(4)@REPLACE(?,?,?,?)@REPLACE(a1, a2, a3[, a4]). Cadena. Se sustituyen en a1 las apariciones de a2 con el valor a3. El argumento opcional a4 especifica el número de apariciones que se sustituyen; si se omite a4 se sustituyen todas las apariciones. Los argumentos a1, a2 y a3 deben resolverse a valores de cadena (cadenas literales entrecomilladas o variables de cadena) y el argumento opcional a4 debe resolverse a un entero no negativo. Por ejemplo, REPLACE("abcabc", "a", "x") devuelve un valor "xbcxbc" y REPLACE("abcabc", "a", "x", 1) devuelve un valor "xbcabc".
rnd(1)1=1@Rnd(1)@RND(?)@RND(expr_num[,mult,fuzzbits]). Numérico. Con un argumento simple, devuelve el entero más cercano al argumento. Los números que terminan en ,5 se redondean a 0. Por ejemplo, RND(-4,5) se redondea a -5. El segundo argumento opcional, mult, especifica que el resultado es un entero múltiple de este valor, por ejemplo, RND(-4,57,0,1) = -4.6. El valor debe ser numérico pero no puede ser 0. El valor por defecto es 1. El tercer argumento opcional, fuzzbits, es el número de bits menos significativos por el que numexpr puede ser inferior al umbral de redondeo (por ejemplo, 0,5 cuando se redondea a un entero), pero se redondeará. Si se omite, se utiliza el ajuste del sistema de FUZZBITS (definido como 6 en el momento de la instalación).
rnd(2)1=1@Rnd(2)@RND(?,?)@RND(expr_num[,mult,fuzzbits]). Numérico. Con un argumento simple, devuelve el entero más cercano al argumento. Los números que terminan en ,5 se redondean a 0. Por ejemplo, RND(-4,5) se redondea a -5. El segundo argumento opcional, mult, especifica que el resultado es un entero múltiple de este valor, por ejemplo, RND(-4,57,0,1) = -4.6. El valor debe ser numérico pero no puede ser 0. El valor por defecto es 1. El tercer argumento opcional, fuzzbits, es el número de bits menos significativos por el que numexpr puede ser inferior al umbral de redondeo (por ejemplo, 0,5 cuando se redondea a un entero), pero se redondeará. Si se omite, se utiliza el ajuste del sistema de FUZZBITS (definido como 6 en el momento de la instalación).
rnd(3)1=1@Rnd(3)@RND(?,?,?)@RND(expr_num[,mult,fuzzbits]). Numérico. Con un argumento simple, devuelve el entero más cercano al argumento. Los números que terminan en ,5 se redondean a 0. Por ejemplo, RND(-4,5) se redondea a -5. El segundo argumento opcional, mult, especifica que el resultado es un entero múltiple de este valor, por ejemplo, RND(-4,57,0,1) = -4.6. El valor debe ser numérico pero no puede ser 0. El valor por defecto es 1. El tercer argumento opcional, fuzzbits, es el número de bits menos significativos por el que numexpr puede ser inferior al umbral de redondeo (por ejemplo, 0,5 cuando se redondea a un entero), pero se redondeará. Si se omite, se utiliza el ajuste del sistema de FUZZBITS (definido como 6 en el momento de la instalación).
rtrim(1)16=16@Rtrim(1)@RTRIM(?)@RTRIM(expr_cadena[, carácter]). Cadena. Recorta las apariciones posteriores del carácter dentro de expr_cadena. El segundo argumento opcional, carácter, debe ser un único carácter entrecomillado o una expresión de cadena que dé lugar a un único carácter. Si no se especifica char, se eliminan los blancos de relleno posteriores.
rtrim(2)16=16@Rtrim(2)@RTRIM(?,?)@RTRIM(expr_cadena[, carácter]). Cadena. Recorta las apariciones posteriores del carácter dentro de expr_cadena. El segundo argumento opcional, carácter, debe ser un único carácter entrecomillado o una expresión de cadena que dé lugar a un único carácter. Si no se especifica char, se eliminan los blancos de relleno posteriores.
rv.bernoulli12=12@Rv.Bernoulli@RV.BERNOULLI(?)@RV.BERNOULLI(p). Numérico. Devuelve un valor aleatorio de la distribución de Bernoulli, con el parámetro de probabilidad p especificado.
rv.beta12=12@Rv.Beta@RV.BETA(?,?)@RV.BETA(forma1, forma2). Numérico. Devuelve un valor aleatorio de la distribución Beta con los parámetros de forma especificados.
rv.binom12=12@Rv.Binom@RV.BINOM(?,?)@RV.BINOM(n, p). Numérico. Devuelve un valor aleatorio de la distribución binomial, con el número de intentos y el parámetro de probabilidad especificados.
rv.cauchy12=12@Rv.Cauchy@RV.CAUCHY(?,?)@RV.CAUCHY(loc, escala). Numérico. Devuelve un valor aleatorio de la distribución Cauchy con los parámetros de ubicación y escala especificados.
rv.chisq12=12@Rv.Chisq@RV.CHISQ(?)@RV.CHISQ(gl). Numérico. Devuelve un valor aleatorio de la distribución de chi-cuadrado con los grados de libertad gl especificados.
rv.exp12=12@Rv.Exp@RV.EXP(?)@RV.EXP(escala). Numérico. Devuelve un valor aleatorio de la distribución exponencial con el parámetro de escala especificado.
rv.f12=12@Rv.F@RV.F(?,?)@RV.F(gl1, gl2). Numérico. Devuelve un valor aleatorio de una distribución F, con los grados de libertad, gl1 y gl2, especificados.
rv.gamma12=12@Rv.Gamma@RV.GAMMA(?,?)@RV.GAMMA(forma, escala). Numérico. Devuelve un valor aleatorio de la distribución Gamma con los parámetros de forma y escala especificados.
rv.geom12=12@Rv.Geom@RV.GEOM(?)@RV.GEOM(p). Numérico. Devuelve un valor aleatorio de la distribución geométrica con el parámetro de probabilidad especificado.
rv.halfnrm12=12@Rv.Halfnrm@RV.HALFNRM(?)@RV.HALFNRM(media, desv_típ). Numérico. Devuelve un valor aleatorio de la distribución seminormal con la media y desviación típica especificadas.
rv.hyper12=12@Rv.Hyper@RV.HYPER(?,?,?)@RV.HYPER(total, muestra, aciertos). Numérico. Devuelve un valor aleatorio de la distribución hipergeométrica con los parámetros especificados.
rv.igauss12=12@Rv.Igauss@RV.IGAUSS(?,?)@RV.IGAUSS(loc, escala). Numérico. Devuelve un valor aleatorio de la distribución de Gauss inversa con los parámetros de ubicación y escala especificados.
rv.laplace12=12@Rv.Laplace@RV.LAPLACE(?,?)@RV.LAPLACE(media, escala). Numérico. Devuelve un valor aleatorio de la distribución Laplace con los parámetros de media y escala especificados.
rv.lnormal12=12@Rv.Lnormal@RV.LNORMAL(?,?)@RV.LNORMAL(a, b). Numérico. Devuelve un valor aleatorio de la distribución log-normal con los parámetros especificados.
rv.logistic12=12@Rv.Logistic@RV.LOGISTIC(?,?)@RV.LOGISTIC(media, escala). Numérico. Devuelve un valor aleatorio de la distribución logística con los parámetros de media y escala especificados.
rv.negbin12=12@Rv.Negbin@RV.NEGBIN(?,?)@RV.NEGBIN(umbral, p). Numérico. Devuelve un valor aleatorio de la distribución binomial negativa con el umbral y los parámetros de probabilidad especificados.
rv.normal12=12@Rv.Normal@RV.NORMAL(?,?)@RV.NORMAL(media, desv_típ). Numérico. Devuelve un valor aleatorio de la distribución normal con la media y desviación típica especificadas.
rv.pareto12=12@Rv.Pareto@RV.PARETO(?,?)@RV.PARETO(umbral, forma). Numérico. Devuelve un valor aleatorio de la distribución Pareto con el umbral y los parámetros de forma especificados.
rv.poisson12=12@Rv.Poisson@RV.POISSON(?)@RV.POISSON(media). Numérico. Devuelve un valor aleatorio de la distribución de Poisson con el parámetro de media o tasa especificado.
rv.t12=12@Rv.T@RV.T(?)@RV.T(gl). Numérico. Devuelve un valor aleatorio de la distribución t de Student con los grados de libertad gl especificados.
rv.uniform12=12@Rv.Uniform@RV.UNIFORM(?,?)@RV.UNIFORM(mín, máx). Numérico. Devuelve un valor aleatorio de la distribución uniforme con el mínimo y el máximo especificados. Véase también la función UNIFORM.
rv.weibull12=12@Rv.Weibull@RV.WEIBULL(?,?)@RV.WEIBULL(a, b). Numérico. Devuelve un valor aleatorio de la distribución de Weibull con los parámetros especificados.
sd15=15@Sd@SD(?,?)@SD(expr_num, expr_num[,..]). Numérico. Devuelve la desviación típica de sus argumentos que contienen valores válidos y no perdidos. Esta función requiere dos o más argumentos que deben ser numéricos. Puede especificar el número mínimo de argumentos válidos para que esta función se evalúe.
sig.chisq14=14@Sig.Chisq@SIG.CHISQ(?)@SIG.CHISQ(c, gl). Numérico. Devuelve la probabilidad acumulada de que un valor de la distribución chi-cuadrado, con los grados de libertad gl, sea mayor que c.
sig.f14=14@Sig.F@SIG.F(?)@SIG.F(c, gl1, gl2). Numérico. Devuelve la probabilidad acumulada de que un valor de la distribución F, con los grados de libertad gl1 y gl2 dados, sea mayor que c.
sin1=1@Sin@SIN(?)@SIN(radianes). Numérico. Devuelve el seno de radianes, que debe ser un valor numérico, medido en radianes.
sqrt1=1@Sqrt@SQRT(?)@SQRT(expr_num). Numérico. Devuelve la raíz cuadrada positiva de expr_num, la cual debe ser numérica y no negativa.
strapplymodel19=19@Strapplymodel@StrApplyModel(?,?,?)@StrApplyModel(asa, "función", valor). Cadena. Aplica una función de puntuación particular a los datos por casos de entrada, utilizando el modelo especificado en el asa y donde "función" es uno de los siguientes valores literales entrecomillado: predict, stddev, probability, confidence, nodeid, cumhazard, neighbor, distance. El asa del modelo es el nombre asociado al archivo XML externo, tal como se haya definido en el comando MODEL HANDLE. El tercer argumento opcional se aplica cuando la función es "probability", "neighbor" o "distance". En "probability", especifica una categoría para la que se calcula la probabilidad. En "neighbor" y "distance", especifica un vecino concreto (como un entero) para los modelos de vecinos más cercanos. StrApplyModel devuelve el valor en blanco si un valor no puede calcularse.
string3=3@String@STRING(?,?)@STRING(expr_num, formato) Cadena. Devuelve la cadena que resulta de convertir expr_num en una cadena, de acuerdo con el formato especificado. STRING(-1,5,F5.2) devuelve el valor de cadena "-1,5". El segundo argumento debe ser un formato para la escritura de un valor numérico.
strunc16=16@Strunc@STRUNC(?,?)@STRUNC (expr_cadena, longitud). Cadena. Devuelve expr_cadena truncado en longitud (en bytes) y suprime los blancos posteriores. La truncación elimina cualquier fragmento de un carácter que se trunque.
sum15=15@Sum@SUM(?,?)@SUM(expr_num, expr_num[,..]). Numérico. Devuelve la suma aritmética de sus argumentos que contienen valores válidos y no perdidos. Esta función requiere dos o más argumentos que deben ser numéricos. Puede especificar el número mínimo de argumentos válidos para que esta función se evalúe.
sysmis10=10@Sysmis@SYSMIS(?)@SYSMIS(varnum). Lógico. Devuelve 1 o verdadero si la variable tiene un valor perdido. El argumento varnum debe ser el nombre de variable numérica del conjunto de datos activo.
time.days17=17@Time.Days@TIME.DAYS(?)@TIME.DAYS(días). Numérico. Devuelve un intervalo de tiempo correspondiente al número de días indicado. El argumento debe ser numérico. Para visualizar el resultado como un tiempo, asígnele un formato de tiempo a la variable de resultado.
time.hms(1)17=17@Time.Hms(1)@TIME.HMS(?)@TIME.HMS(horas[,minutos,segundos]). Numérico. Devuelve un intervalo de tiempo correspondiente al número de horas, minutos y segundos indicados. Los argumentos de minutos y los segundos son opcionales. Los minutos y segundos se deben resolver a números inferiores a 60 si cualquier argumento de orden superior no es cero. Todos los argumentos excepto el último argumento distinto de cero deben evaluarse como enteros. Por ejemplo, TIME.HMS(25.5) y TIME.HMS(0,90,25.5) son válidos, mientras TIME.HMS(25.5,30) y TIME.HMS(25,90) son inválidos. Todos los argumentos deben evaluarse como todos positivos o todos negativos. Para visualizar el resultado como un tiempo, asígnele un formato de tiempo a la variable de resultado.
time.hms(2)17=17@Time.Hms(2)@TIME.HMS(?,?)@TIME.HMS(horas[,minutos,segundos]). Numérico. Devuelve un intervalo de tiempo correspondiente al número de horas, minutos y segundos indicados. Los argumentos de minutos y los segundos son opcionales. Los minutos y segundos se deben resolver a números inferiores a 60 si cualquier argumento de orden superior no es cero. Todos los argumentos excepto el último argumento distinto de cero deben evaluarse como enteros. Por ejemplo, TIME.HMS(25.5) y TIME.HMS(0,90,25.5) son válidos, mientras TIME.HMS(25.5,30) y TIME.HMS(25,90) son inválidos. Todos los argumentos deben evaluarse como todos positivos o todos negativos. Para visualizar el resultado como un tiempo, asígnele un formato de tiempo a la variable de resultado.
time.hms(3)17=17@Time.Hms(3)@TIME.HMS(?,?,?)@TIME.HMS(horas[,minutos,segundos]). Numérico. Devuelve un intervalo de tiempo correspondiente al número de horas, minutos y segundos indicados. Los argumentos de minutos y los segundos son opcionales. Los minutos y segundos se deben resolver a números inferiores a 60 si cualquier argumento de orden superior no es cero. Todos los argumentos excepto el último argumento distinto de cero deben evaluarse como enteros. Por ejemplo, TIME.HMS(25.5) y TIME.HMS(0,90,25.5) son válidos, mientras TIME.HMS(25.5,30) y TIME.HMS(25,90) son inválidos. Todos los argumentos deben evaluarse como todos positivos o todos negativos. Para visualizar el resultado como un tiempo, asígnele un formato de tiempo a la variable de resultado.
trunc(1)1=1@Trunc(1)@TRUNC(?)@TRUNC(expr_num[,mult,fuzzbits]). Numérico. Devuelve el valor de expr_num truncado hacia 0. El segundo argumento opcional, mult, especifica que el resultado es un entero múltiple de este valor, por ejemplo, TRUNC(4,579,0,1) = 4,5. El valor debe ser numérico pero no puede ser 0. El valor por defecto es 1. El tercer argumento opcional, fuzzbits, es el número de bits menos significativos por el que numexpr puede ser inferior al umbral de redondeo más cercano y se redondeará antes de truncarse. Por ejemplo, si numexpr está entre 1,4 y 1,5 y mult es 0,1, fuzzbits especifica lo cerca que numexpr puede estar de 1,5 (el límite más cercano) y se redondeará. Si se omite, se utiliza el ajuste del sistema de FUZZBITS (definido como 6 en el momento de la instalación).
trunc(2)1=1@Trunc(2)@TRUNC(?,?)@TRUNC(expr_num[,mult,fuzzbits]). Numérico. Devuelve el valor de expr_num truncado hacia 0. El segundo argumento opcional, mult, especifica que el resultado es un entero múltiple de este valor, por ejemplo, TRUNC(4,579,0,1) = 4,5. El valor debe ser numérico pero no puede ser 0. El valor por defecto es 1. El tercer argumento opcional, fuzzbits, es el número de bits menos significativos por el que numexpr puede ser inferior al umbral de redondeo más cercano y se redondeará antes de truncarse. Por ejemplo, si numexpr está entre 1,4 y 1,5 y mult es 0,1, fuzzbits especifica lo cerca que numexpr puede estar de 1,5 (el límite más cercano) y se redondeará. Si se omite, se utiliza el ajuste del sistema de FUZZBITS (definido como 6 en el momento de la instalación).
trunc(3)1=1@Trunc(3)@TRUNC(?,?,?)@TRUNC(expr_num[,mult,fuzzbits]). Numérico. Devuelve el valor de expr_num truncado hacia 0. El segundo argumento opcional, mult, especifica que el resultado es un entero múltiple de este valor, por ejemplo, TRUNC(4,579,0,1) = 4,5. El valor debe ser numérico pero no puede ser 0. El valor por defecto es 1. El tercer argumento opcional, fuzzbits, es el número de bits menos significativos por el que numexpr puede ser inferior al umbral de redondeo más cercano y se redondeará antes de truncarse. Por ejemplo, si numexpr está entre 1,4 y 1,5 y mult es 0,1, fuzzbits especifica lo cerca que numexpr puede estar de 1,5 (el límite más cercano) y se redondeará. Si se omite, se utiliza el ajuste del sistema de FUZZBITS (definido como 6 en el momento de la instalación).
upcase16=16@Upcase@UPCASE(?)@UPCAS(expr_cadena). Cadena. Devuelve la expr_cadena con las letras minúsculas cambiadas a mayúsculas y los demás caracteres inalterados.
value10=10@Value@VALUE(?)@VALUE(variable). Numérico o cadena. Devuelve el valor de variable, ignorando las definiciones de valor perdido del usuario para variable, la cual debe ser un nombre de variable o una referencia de vector a un nombre de variable.
valuelabel9=9@Valuelabel@VALUELABEL(?)@VALUELABEL(nombre_var). Cadena. Devuelve la etiqueta del valor de la variable o una cadena vacía si el valor no dispone de etiqueta El valor de nombre_var debe ser un nombre de variable; no puede ser una expresión.
variance15=15@Variance@VARIANCE(?,?)@VARIANCE(expr_num, expr_num [, ...]). Numérico. Devuelve la varianza de los argumentos que tengan valores válidos. Esta función requiere dos o más argumentos que deben ser numéricos. Puede especificar el número mínimo de argumentos válidos para que esta función se evalúe.
xdate.date7=7@Xdate.Date@XDATE.DATE(?)@XDATE.DATE(valorfecha). Numérico. Devuelve la porción de fecha de un valor numérico que representa una fecha. El argumento puede ser un número, una variable con formato de fecha o una expresión evaluable a una fecha. Para mostrar el resultado como una fecha, aplique un formato de fecha a la variable.
xdate.hour18=18@Xdate.Hour@XDATE.HOUR(?)@XDATE.HOUR(valorfecha). Numérico. Devuelve la hora (un entero entre 0 y 23) a partir de un valor que representa un tiempo o una fecha. El argumento puede ser un número, una variable de tiempo o de fecha, o una expresión que se evalúa como un valor de tiempo o fecha.
xdate.jday7=7@Xdate.Jday@XDATE.JDAY(?)@XDATE.JDAY(valorfecha). Numérico. Devuelve el día del año (un entero entre 1 y 366) a partir de un valor numérico que representa una fecha. El argumento puede ser un número, una variable con formato de fecha o una expresión evaluable a una fecha.
xdate.mday7=7@Xdate.Mday@XDATE.MDAY(?)@XDATE.MDAY(valorfecha). Numérico. Devuelve el día del mes (un entero entre 1 y 31) a partir de un valor numérico que representa una fecha. El argumento puede ser un número, una variable con formato de fecha o una expresión evaluable a una fecha.
xdate.minute18=18@Xdate.Minute@XDATE.MINUTE(?)@XDATE.MINUTE(valorfecha). Numérico. Devuelve el minuto (un entero entre 0 y 59) a partir de un valor que representa un tiempo o una fecha. El argumento puede ser un número, o una variable de fecha o una expresión evaluable como un valor de fecha o de tiempo.
xdate.month7=7@Xdate.Month@XDATE.MONTH(?)@XDATE.MONTH(valorfecha). Numérico. Devuelve el mes (un entero entre 1 y 12) a partir de un valor numérico que representa una fecha. El argumento puede ser un número, una variable con formato de fecha o una expresión evaluable a una fecha.
xdate.quarter7=7@Xdate.Quarter@XDATE.QUARTER(?)@XDATE.QUARTER(valorfecha). Numérico. Devuelve el trimestre del año (un entero entre 1 y 4) a partir de un valor numérico que represente una fecha. El argumento puede ser un número, una variable con formato de fecha o una expresión evaluable a una fecha.
xdate.second18=18@Xdate.Second@XDATE.SECOND(?)@XDATE.SECOND(valorfecha). Numérico. Devuelve el segundo (un número entre 0 y 60) a partir de un valor que represente un tiempo o una fecha. El argumento puede ser un número, una variable de tiempo o de fecha, o una expresión que se evalúa como un valor de tiempo o fecha.
xdate.tday7=7@Xdate.Tday@XDATE.TDAY(?)@XDATE.TDAY(valortiempo). Numérico. Devuelve el número de días completos (como un entero) a partir de un valor numérico que represente un intervalo de tiempo. El argumento puede ser un número, una variable con formato de fecha o una expresión evaluable como un intervalo de tiempo.
xdate.tday18=18@Xdate.Tday@XDATE.TDAY(?)@XDATE.TDAY(valortiempo). Numérico. Devuelve el número de días completos (como un entero) a partir de un valor numérico que represente un intervalo de tiempo. El argumento puede ser un número, una variable con formato de fecha o una expresión evaluable como un intervalo de tiempo.
xdate.time7=7@Xdate.Time@XDATE.TIME(?)@XDATE.TIME(valorfecha). Numérico. Devuelve la porción de tiempo a partir de un valor que represente un tiempo o una fecha. El argumento puede ser un número, una variable de tiempo o de fecha, o una expresión que se evalúa como un valor de tiempo o fecha. Para mostrar el resultado como un tiempo, aplique un formato de tiempo a la variable.
xdate.week7=7@Xdate.Week@XDATE.WEEK(?)@XDATE.WEEK(valorfecha). Numérico. Devuelve el número de la semana (un entero entre 1 y 53) a partir de un valor numérico que represente una fecha. El argumento puede ser un número, una variable con formato de fecha o una expresión evaluable a una fecha.
xdate.wkday7=7@Xdate.Wkday@XDATE.WKDAY(?)@XDATE.WKDAY(valorfecha). Numérico. Devuelve el número del día de la semana (un entero entre 1, domingo, y 7, sábado) a partir de un valor numérico que represente una fecha. El argumento puede ser un número, una variable con formato de fecha o una expresión evaluable a una fecha.
xdate.year7=7@Xdate.Year@XDATE.YEAR(?)@XDATE.YEAR(valorfecha). Numérico. Devuelve el año (un entero de cuatro dígitos) a partir de un valor numérico que represente una fecha. El argumento puede ser un número, una variable con formato de fecha o una expresión evaluable a una fecha.
yrmoda7=7@Yrmoda@YRMODA(?,?,?)@YRMODA(año, mes, día). Numérico. Devuelve el número de días desde el 15 de octubre de 1582 hasta la fecha representada por los argumentos años, mes y día, que deben ser enteros que formen una fecha válida desde el 15 de octubre de 1582. Los valores de año de dos dígitos toman como base el siglo definido en la configuración de Opciones (menú Edición, Opciones, pestaña Datos). Por defecto, para los años de dos dígitos se asume un rango que establece un rango de 100 años que empieza 69 años antes del año actual y termina 30 años después del año actual.
